# specify a directory to install
cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask' || true
tap "AdoptOpenJDK/openjdk"
tap "thoughtbot/formulae"

# Install Packages
brew 'git'
brew 'bash-completion'
brew 'tree'
brew 'node'
brew 'scala'
brew 'sbt'
cask "adoptopenjdk8" # needed for coursier
brew 'coursier/formulas/coursier'
brew "scalacenter/bloop/bloop"
brew 'ammonite-repl'
brew 'awscli'
brew 'postgresql'
brew 'gh'
brew 'rcm'
brew 'docker-compose'
brew 'antigen'
brew 'thefuck'

# Casks
cask 'google-chrome'
cask 'alfred'
cask 'slack'
cask 'spotify'
cask 'kindle'
cask '1password'
cask 'iterm2'
cask 'intellij-idea-ce'
cask 'docker'
cask 'visual-studio-code'
cask 'p4v'
cask 'postman'
cask 'zoomus'
cask 'bettertouchtool'
cask 'tunnelblick'
cask 'notion'
cask 'firefox'
cask 'figma'

mas "Spark - Email App by Readdle", id: 1176895641
mas "Bear", id: 1091189122
mas "Amphetamine", id: 937984704
